[
  {
    "id": "it-keeper",
    "title": "Cloud Infrastructure Engineer",
    "company": "IT-KEEPER",
    "companyLogo": "/IT-KEEPER-logo.png",
    "period": "March 2024 – Present",
    "city": "Remote, Mexico",
    "description": [
      "Designed and implemented a comprehensive disaster recovery solution for a medium-sized company using AWS services.",
      "Configured EC2 instances running VPN on Ubuntu with OpenVPN for secure remote access.",
      "Deployed Windows Server 2019 with DNS and Active Directory for centralized network management and user access control.",
      "Defined user policies and shared resources within Active Directory to strengthen security and resource allocation.",
      "Owned the entire project lifecycle from architecture design to production deployment.",
      "Conducted cybersecurity audits across multiple clients, identifying and remediating security breaches."
    ],
    "technologies": ["AWS", "EC2", "Ubuntu", "OpenVPN", "Windows Server 2019", "Active Directory", "DNS", "Node.js", "Express", "MongoDB", "React", "Docker", "Socket.io", "JWT", "n8n"],
    "leadership": false,
    "highlightedProject": {
      "title": "WhatsApp Multi-Session Management Platform",
      "description": [
        "Architected and developed a full-stack, microservices-based platform enabling real-time monitoring, automated message processing, and conversational analytics via n8n integrations.",
        "Designed a 3-service microservices architecture (Node.js, Express, MongoDB, React, Docker) supporting 30+ concurrent WhatsApp sessions with Socket.io for real-time communication.",
        "Implemented multi-layer security including JWT rotation, sanitization, rate limiting, and OWASP best practices.",
        "Developed a modular React frontend with 40+ reusable components and optimized session handling UI.",
        "Delivered a production-ready platform with health monitoring, structured logging, CI/CD pipelines, and Docker Compose orchestration."
      ],
      "technologies": ["Node.js", "Express", "MongoDB", "React", "Docker", "Socket.io", "JWT", "n8n", "OWASP"],
      "screenshot": "/whatsappsummary.png"
    }
  },
  {
    "id": "bbva",
    "title": "Front-End Developer",
    "company": "BBVA Bank",
    "companyLogo": "/bbva-logo.png",
    "period": "March 2022 – March 2024",
    "city": "Mexico City, Mexico",
    "description": [
      "Led the front-end team in developing and launching a new internal application using JavaScript ES6, Lit-Element, HTML5, CSS3, Git, MochaJS, Bitbucket, and Jenkins for CI/CD.",
      "Streamlined development by building reusable components, significantly reducing development time.",
      "Documented and maintained API references, ensuring seamless integration for internal developers.",
      "Migrated legacy systems to modern architectures, achieving a key modernization milestone.",
      "Collaborated closely with backend, UX/UI, Scrum Masters, and Product Owners to ensure high-quality delivery.",
      "Led and mentored a team of front-end developers, prioritizing tasks to ensure timely delivery and quality (March 2023 – March 2024).",
      "Provided technical guidance and onboarding for new team members, improving team performance and integration."
    ],
    "technologies": ["JavaScript ES6", "Lit-Element", "HTML5", "CSS3", "Git", "MochaJS", "Bitbucket", "Jenkins", "CI/CD"],
    "leadership": true
  },
  {
    "id": "ahea",
    "title": "Front-End Developer",
    "company": "AHEA University by Ectotec",
    "companyLogo": "/AHEA-logo.png",
    "period": "March 2021 – March 2022",
    "city": "Remote, Mexico",
    "description": [
      "Co-built a new educational platform from the ground up for students, professors, and administrators.",
      "Developed modules using React 17 (Hooks), Redux, and React Router.",
      "Built a scalable, high-quality video conferencing module using WebRTC and Amazon Chime, providing a Zoom-like experience.",
      "Created a reusable component library to accelerate development and maintain a consistent UI.",
      "Collaborated with QA, backend, and design teams using Agile SCRUM methodology."
    ],
    "technologies": ["React 17", "Hooks", "Redux", "React Router", "WebRTC", "Amazon Chime", "Agile", "SCRUM"]
  },
  {
    "id": "oaxaca",
    "title": "Front-End Developer",
    "company": "Oaxaca State Government Administration Office by iGenter",
    "companyLogo": "/admon-oaxaca.jpg",
    "period": "March 2020 – March 2021",
    "city": "Remote, Mexico",
    "description": [
      "Contributed to the development of a resource management dashboard for the Oaxaca government administration.",
      "Built the front end using React 16, Redux, Axios, SASS, Material UI, and GitLab.",
      "Worked under Scrum methodology, coordinating with backend and design teams to deliver functional interfaces."
    ],
    "technologies": ["React 16", "Redux", "Axios", "HTML5", "CSS3", "SASS", "Material UI", "Git", "GitLab", "Postman"]
  },
  {
    "id": "ksh",
    "title": "Software Developer",
    "company": "Kristal Software House",
    "companyLogo": "/ksh.png",
    "period": "September 2019 – March 2020",
    "city": "Mexico City, Mexico",
    "description": [
      "Developed custom modules for Epicor 10 ERP using C#, SQL Server, and Epicor BAQs.",
      "Designed stored procedures, views, triggers, and functions to maintain data integrity and improve performance.",
      "Monitored and debugged a Java 8-based billing system integrated with SQL Server.",
      "Managed roles and permissions for Epicor and SQL Server environments.",
      "Communicated directly with clients to gather requirements and address incidents efficiently."
    ],
    "technologies": ["C#", "SQL Server", "Epicor 10 ERP", "Epicor BAQs", "Java 8", "Stored Procedures", "Triggers", "Functions"]
  }
]
